Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/getting_started.po
Languages: ru

source: Getting Started
ru: Начало работы

source: Installation
ru: Установка

source: **Basic installation** (inference only):
ru: **Базовая установка** (только инференс):

source: **Installation with training support** (includes PyTorch):
ru: **Установка с поддержкой обучения** (включает PyTorch):

source: This installs additional dependencies for model training:
ru: Будут установлены дополнительные зависимости для обучения моделей:

source: PyTorch and TorchVision
ru: PyTorch и TorchVision

source: ONNX export tools
ru: Инструменты экспорта ONNX

source: Training utilities (albumentations, tensorboard, etc.)
ru: Утилиты для обучения (albumentations, TensorBoard и др.)

source: Development tools (pytest, black, flake8, etc.)
ru: Инструменты разработки (pytest, black, flake8 и др.)

source: **GPU acceleration** (NVIDIA CUDA):
ru: **Аппаратное ускорение GPU** (NVIDIA CUDA):

source: **Apple Silicon acceleration** (CoreML):
ru: **Ускорение на Apple Silicon** (CoreML):

source: Quick Start
ru: Быстрый старт

source: Basic usage example:
ru: Пример базового использования:

source: Main Components
ru: Основные компоненты

source: :class:`~manuscript.Pipeline` - High-level OCR pipeline
ru: :class:`~manuscript.Pipeline` — высокоуровневый OCR-конвейер

source: :class:`~manuscript.detectors.EAST` - Text detector
ru: :class:`~manuscript.detectors.EAST` — детектор текста

source: :class:`~manuscript.recognizers.TRBA` - Text recognizer
ru: :class:`~manuscript.recognizers.TRBA` — модель распознавания текста

source: :class:`~manuscript.data.Page` - Page data structure
ru: :class:`~manuscript.data.Page` — структура данных страницы

source: :class:`~manuscript.data.Block` - Block data structure
ru: :class:`~manuscript.data.Block` — структура данных блока

source: :class:`~manuscript.data.Line` - Line data structure
ru: :class:`~manuscript.data.Line` — структура данных строки

source: :class:`~manuscript.data.Word` - Word data structure
ru: :class:`~manuscript.data.Word` — структура данных слова
