Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/structure.po
Languages: ru

source: Library Structure
ru: Структура библиотеки

source: Overview of the manuscript-ocr library architecture.
ru: Обзор архитектуры библиотеки manuscript-ocr.

source: Module Descriptions
ru: Описание модулей

source: The main high-level interface that combines detection and recognition into a single OCR workflow.
ru: Основной высокоуровневый интерфейс, объединяющий детекцию и распознавание в единый OCR-конвейер.

source: Data structures (``Page``, ``Block``, ``Line``, ``Word``) for representing OCR results in a hierarchical format.
ru: Структуры данных (``Page``, ``Block``, ``Line``, ``Word``) для представления результатов OCR в иерархическом формате.

source: Text detection models. Currently includes ``EAST`` (Efficient and Accurate Scene Text Detector).
ru: Модели детекции текста. В настоящее время включает ``EAST`` (Efficient and Accurate Scene Text Detector).

source: Text recognition models. Currently includes ``TRBA`` (Text Recognition with BiLSTM and Attention mechanism).
ru: Модели распознавания текста. В настоящее время включает ``TRBA`` (TPS-ResNet-BiLSTM-Attention).

source: Utility functions for:
ru: Вспомогательные функции для:

source: I/O operations (``read_image``)
ru: операций ввода-вывода (``read_image``)

source: Visualization (``visualize_page``)
ru: визуализации (``visualize_page``)

source: Sorting and organization (``organize_page``)
ru: сортировки и организации данных (``organize_page``)

source: Training utilities (``set_seed``)
ru: утилит для обучения (``set_seed``)
