Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/api/data.po
Languages: ru

source: Data Structures
ru: Структуры данных

source: Core data structures for representing OCR results.
ru: Основные структуры данных для представления результатов OCR.

source: Data Model
ru: Модель данных

source: The following diagram shows the relationships between data structures:
ru: Следующая диаграмма показывает взаимосвязи между структурами данных:

source: API Reference
ru: Справочник API

source: Data structures for manuscript OCR.
ru: Структуры данных для OCR рукописей.

source: This package contains the core data structures used to represent OCR results throughout the manuscript-ocr library.
ru: Этот пакет содержит основные структуры данных, используемые для представления результатов OCR во всей библиотеке manuscript-ocr.

source: A single detected or recognized word.
ru: Одно обнаруженное или распознанное слово.

source: Parameters
ru: Параметры

source: Return type
ru: Тип возвращаемого значения

source: Polygon vertices (x, y), ordered clockwise. For quadrilateral text regions: TL → TR → BR → BL (Top-Left, Top-Right, Bottom-Right, Bottom-Left).
ru: Вершины полигона (x, y), упорядоченные по часовой стрелке. Для четырёхугольных текстовых областей: TL → TR → BR → BL (верхний левый, верхний правый, нижний правый, нижний левый).

source: type
ru: тип

source: Text detection confidence score from detector (0.0 to 1.0).
ru: Оценка уверенности детекции текста от детектора (от 0.0 до 1.0).

source: Recognized text content (populated by OCR pipeline). None if only detection was performed.
ru: Распознанное текстовое содержимое (заполняется OCR-конвейером). None, если выполнялась только детекция.

source: str, optional
ru: str, необязательный

source: Text recognition confidence score from recognizer (0.0 to 1.0). None if only detection was performed.
ru: Оценка уверенности распознавания текста от распознавателя (от 0.0 до 1.0). None, если выполнялась только детекция.

source: float, optional
ru: float, необязательный

source: Word position inside the line after sorting. None before sorting.
ru: Позиция слова внутри строки после сортировки. None до сортировки.

source: int, optional
ru: int, необязательный

source: Examples
ru: Примеры

source: Methods
ru: Методы

source: Call self as a function.
ru: Вызов объекта как функции.

source: A single text line containing one or more words.
ru: Одна текстовая строка, содержащая одно или несколько слов.

source: List of words in the line.
ru: Список слов в строке.

source: Line position inside a block or page after sorting. None before sorting.
ru: Позиция строки внутри блока или страницы после сортировки. None до сортировки.

source: A logical text block (e.g., paragraph, column).
ru: Логический текстовый блок (например, абзац или колонка).

source: List of text lines in the block.
ru: Список текстовых строк в блоке.

source: Legacy: Direct list of words without line structure. Used for backward compatibility. If both `lines` and `words` are empty, creates a single line from words.
ru: Устаревшее: прямой список слов без структуры строк. Используется для обратной совместимости. Если и `lines`, и `words` пусты, создаётся одна строка из слов.

source: List[Word], optional
ru: List[Word], необязательный

source: Block reading-order position after sorting. None before sorting.
ru: Позиция блока в порядке чтения после сортировки. None до сортировки.

source: Initialize Block with backward compatibility for words-only input.
ru: Инициализация Block с обратной совместимостью для ввода только слов.

source: A document page containing blocks of text.
ru: Страница документа, содержащая текстовые блоки.

source: For a full visual diagram of the data model, see: ``DATA_MODEL.md`` located in the same module directory.
ru: Полную визуальную диаграмму модели данных см. в файле ``DATA_MODEL.md``, расположенном в том же каталоге модуля.

source: List of text blocks on the page.
ru: Список текстовых блоков на странице.
