Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/api/detectors.po
Languages: ru

source: Detectors
ru: Детекторы

source: Text detection models.
ru: Модели детекции текста.

source: Initialize EAST text detector with ONNX Runtime.
ru: Инициализация текстового детектора EAST с использованием ONNX Runtime.

source: Parameters
ru: Параметры

source: Path to ONNX model weights. If None, the model will be automatically downloaded to ``~/.manuscript/east/east_50_g1.onnx``.
ru: Путь к весам модели ONNX. Если None, модель будет автоматически загружена в ``~/.manuscript/east/east_50_g1.onnx``.

source: Compute device: ``"cuda"``, ``"coreml"``, or ``"cpu"``. If None, automatically selects CPU. For GPU/CoreML acceleration: - CUDA (NVIDIA): ``pip install onnxruntime-gpu`` - CoreML (Apple Silicon M1/M2/M3): ``pip install onnxruntime-silicon`` Default is ``None`` (CPU).
ru: Устройство вычислений: ``"cuda"``, ``"coreml"`` или ``"cpu"``. Если None, автоматически выбирается CPU. Для ускорения GPU/CoreML: - CUDA (NVIDIA): ``pip install onnxruntime-gpu`` - CoreML (Apple Silicon M1/M2/M3): ``pip install onnxruntime-silicon`` По умолчанию ``None`` (CPU).

source: Compute device: ``"cuda"``, ``"coreml"``, or ``"cpu"``. If None, automatically selects CPU. For GPU/CoreML acceleration:
ru: Устройство вычислений: ``"cuda"``, ``"coreml"`` или ``"cpu"``. Если None, автоматически выбирается CPU. Для ускорения GPU/CoreML:

source: Default is ``None`` (CPU).
ru: По умолчанию ``None`` (CPU).

source: Input image size for inference. Images are resized to ``(target_size, target_size)``. Default is 1280.
ru: Размер входного изображения для инференса. Изображения приводятся к ``(target_size, target_size)``. Значение по умолчанию — 1280.

source: Horizontal expansion factor applied to detected boxes after NMS. Default is 0.7.
ru: Коэффициент горизонтального расширения, применяемый к боксам после NMS. По умолчанию 0.7.

source: Vertical expansion factor applied to detected boxes after NMS. Default is 0.7.
ru: Коэффициент вертикального расширения, применяемый к боксам после NMS. По умолчанию 0.7.

source: Power for non-linear box expansion. Controls how expansion scales with box size. - 1.0 = linear (small and large boxes expand equally) - <1.0 = small boxes expand more (e.g., 0.5, recommended for character-level detection) - >1.0 = large boxes expand more Default is 0.5.
ru: Степень нелинейного расширения боксов. Определяет, как масштабируется расширение в зависимости от размера бокса. - 1.0 = линейно (малые и большие боксы расширяются одинаково) - <1.0 = малые боксы расширяются сильнее (например, 0.5, рекомендуется для детекции символов) - >1.0 = большие боксы расширяются сильнее Значение по умолчанию — 0.5.

source: Confidence threshold for selecting candidate detections before NMS. Default is 0.7.
ru: Порог уверенности для отбора кандидатов перед NMS. Значение по умолчанию — 0.7.

source: IoU threshold for locality-aware NMS merging phase. Default is 0.2.
ru: Порог IoU для фазы объединения locality-aware NMS. По умолчанию 0.2.

source: IoU threshold for standard NMS after locality-aware merging. If None, uses the same value as iou_threshold. Default is None.
ru: Порог IoU для стандартного NMS после locality-aware объединения. Если None, используется значение iou_threshold. По умолчанию None.

source: Scale factor for decoding geometry/score maps. Default is 0.25.
ru: Коэффициент масштабирования при декодировании карт геометрии/оценок. По умолчанию 0.25.

source: Quantization resolution for point coordinates during decoding. Default is 2.
ru: Разрешение квантования координат точек при декодировании. По умолчанию 2.

source: If True, outputs axis-aligned rectangles instead of original quads. Default is True.
ru: Если True, возвращаются осево-ориентированные прямоугольники вместо исходных четырёхугольников. По умолчанию True.

source: If True, removes quads with extremely large area relative to the distribution. Default is False.
ru: Если True, удаляет четырёхугольники с аномально большой площадью относительно распределения. По умолчанию False.

source: Sigma threshold for anomaly area filtering. Default is 5.0.
ru: Порог сигмы для фильтрации аномальных площадей. По умолчанию 5.0.

source: Minimum number of boxes required before anomaly filtering. Default is 30.
ru: Минимальное количество боксов перед применением фильтрации аномалий. По умолчанию 30.

source: Notes
ru: Примечания

source: The class provides two main public methods:
ru: Класс предоставляет два основных публичных метода:

source: ``predict`` — run inference on a single image and return detections.
ru: ``predict`` — выполняет инференс на одном изображении и возвращает детекции.

source: ``train`` — high-level training entrypoint to train an EAST model on custom datasets.
ru: ``train`` — высокоуровневая точка входа для обучения модели EAST на пользовательских датасетах.

source: The detector uses ONNX Runtime for fast inference on CPU and GPU. For GPU acceleration, install: ``pip install onnxruntime-gpu``
ru: Детектор использует ONNX Runtime для быстрого инференса на CPU и GPU. Для ускорения на GPU установите: ``pip install onnxruntime-gpu``

source: Methods
ru: Методы

source: Call self as a function.
ru: Вызов объекта как функции.

source: Export EAST PyTorch model to ONNX format.
ru: Экспорт модели EAST из PyTorch в формат ONNX.

source: Run EAST inference and return detection results.
ru: Запуск инференса EAST и возврат результатов детекции.

source: Get ONNX Runtime execution providers based on device.
ru: Получение провайдеров выполнения ONNX Runtime в зависимости от устройства.

source: Train EAST model on custom datasets.
ru: Обучение модели EAST на пользовательских датасетах.

source: Path to an image file or an RGB image provided as a NumPy array with shape ``(H, W, 3)`` in ``uint8`` format.
ru: Путь к файлу изображения или RGB-изображение в виде массива NumPy формата ``uint8`` с формой ``(H, W, 3)``.

source: If True, returns raw model score and geometry maps under keys ``"score_map"`` and ``"geo_map"``. Default is False.
ru: Если True, возвращает необработанные карты оценок и геометрии под ключами ``"score_map"`` и ``"geo_map"``. По умолчанию False.

source: If True, sorts detected words in natural reading order (left-to-right, top-to-bottom) and groups them into text lines. Default is True.
ru: Если True, сортирует обнаруженные слова в естественном порядке чтения (слева направо, сверху вниз) и группирует их в строки. По умолчанию True.

source: If True and ``sort_reading_order=True``, segments the page into columns (separate Blocks). If False, treats entire page as single column. Only used when ``sort_reading_order=True``. Default is True.
ru: Если True и ``sort_reading_order=True``, сегментирует страницу на колонки (отдельные Blocks). Если False, вся страница рассматривается как одна колонка. Используется только при ``sort_reading_order=True``. По умолчанию True.

source: Maximum number of columns to detect when ``split_into_columns=True``. Higher values allow more columns to be detected. Only used when ``sort_reading_order=True`` and ``split_into_columns=True``. Default is 10.
ru: Максимальное количество колонок для обнаружения при ``split_into_columns=True``. Большие значения позволяют обнаруживать больше колонок. Используется только при ``sort_reading_order=True`` и ``split_into_columns=True``. По умолчанию 10.

source: Returns
ru: Возвращает

source: Dictionary with the following keys: - ``"page"`` : Page Parsed detection result as a Page object containing Block(s) with Line(s) of Word objects. Each Word has polygon coordinates and confidence scores. Words and Lines have reading order indices. - ``"score_map"`` : numpy.ndarray or None Raw score map produced by the network if ``return_maps=True``. - ``"geo_map"`` : numpy.ndarray or None Raw geometry map if ``return_maps=True``.
ru: Словарь со следующими ключами: - ``"page"`` : Page Разобранный результат детекции в виде объекта Page, содержащего Block(и) со Line(ами) объектов Word. Каждый Word содержит координаты полигона и оценки уверенности. Слова и строки имеют индексы порядка чтения. - ``"score_map"`` : numpy.ndarray или None Необработанная карта оценок, если ``return_maps=True``. - ``"geo_map"`` : numpy.ndarray или None Необработанная карта геометрии, если ``return_maps=True``.

source: Dictionary with the following keys:
ru: Словарь со следующими ключами:

source: Parsed detection result as a Page object containing Block(s) with Line(s) of Word objects. Each Word has polygon coordinates and confidence scores. Words and Lines have reading order indices.
ru: Разобранный результат детекции в виде объекта Page, содержащего Block(и) со Line(ами) объектов Word. Каждый Word имеет координаты полигона и оценки уверенности. Слова и строки имеют индексы порядка чтения.

source: numpy.ndarray or None
ru: numpy.ndarray или None

source: Raw score map produced by the network if ``return_maps=True``.
ru: Необработанная карта оценок, полученная сетью, если ``return_maps=True``.

source: Raw geometry map if ``return_maps=True``.
ru: Необработанная карта геометрии, если ``return_maps=True``.

source: Return type
ru: Тип возвращаемого значения

source: The method performs: (1) image loading, (2) resizing and normalization, (3) model inference, (4) quad decoding, (5) NMS, (6) box expansion, (7) scaling coordinates back to original size, (8) optional reading order sorting into lines.
ru: Метод выполняет: (1) загрузку изображения, (2) изменение размера и нормализацию, (3) инференс модели, (4) декодирование четырёхугольников, (5) NMS, (6) расширение боксов, (7) масштабирование координат обратно к исходному размеру, (8) опциональную сортировку по порядку чтения с группировкой в строки.

source: For visualization, use the external ``visualize_page`` utility:
ru: Для визуализации используйте внешнюю утилиту ``visualize_page``:

source: Examples
ru: Примеры

source: Perform inference and get structured output:
ru: Выполнить инференс и получить структурированный результат:

source: Visualize results separately:
ru: Визуализировать результаты отдельно:

source: Path(s) to training image folders.
ru: Путь(и) к каталогам с обучающими изображениями.

source: Path(s) to COCO-format JSON annotation files corresponding to ``train_images``.
ru: Путь(и) к JSON-файлам аннотаций в формате COCO, соответствующим ``train_images``.

source: Path(s) to validation image folders.
ru: Путь(и) к каталогам с валидационными изображениями.

source: Path(s) to COCO-format JSON annotation files corresponding to ``val_images``.
ru: Путь(и) к JSON-файлам аннотаций в формате COCO, соответствующим ``val_images``.

source: Base directory where experiment folders will be created. Default is ``"./experiments"``.
ru: Базовый каталог, в котором будут создаваться папки экспериментов. По умолчанию ``"./experiments"``.

source: Folder name inside ``experiment_root`` for logs and checkpoints. Default is ``"resnet_quad"``.
ru: Имя папки внутри ``experiment_root`` для логов и чекпоинтов. По умолчанию ``"resnet_quad"``.

source: Backbone architecture to use. Options: - ``"resnet50"`` — ResNet-50 (faster, less parameters) - ``"resnet101"`` — ResNet-101 (slower, more capacity) Default is ``"resnet50"``.
ru: Используемая архитектура backbone. Варианты: - ``"resnet50"`` — ResNet-50 (быстрее, меньше параметров) - ``"resnet101"`` — ResNet-101 (медленнее, больше ёмкость) По умолчанию ``"resnet50"``.

source: Backbone architecture to use. Options:
ru: Используемая архитектура backbone. Варианты:

source: ``"resnet50"`` — ResNet-50 (faster, less parameters)
ru: ``"resnet50"`` — ResNet-50 (быстрее, меньше параметров)

source: ``"resnet101"`` — ResNet-101 (slower, more capacity)
ru: ``"resnet101"`` — ResNet-101 (медленнее, больше ёмкость)

source: Default is ``"resnet50"``.
ru: По умолчанию ``"resnet50"``.

source: Use ImageNet-pretrained backbone weights. Default ``True``.
ru: Использовать веса backbone, предобученные на ImageNet. По умолчанию ``True``.

source: Freeze lowest layers of the backbone. Default ``True``.
ru: Заморозить нижние слои backbone. По умолчанию ``True``.

source: Resize shorter side of images to this size. Default ``1024``.
ru: Изменять размер короткой стороны изображений до этого значения. По умолчанию ``1024``.

source: Multiplier to recover original coordinates from score/geo maps. If None, automatically taken from the model. Default ``None``.
ru: Множитель для восстановления исходных координат из карт оценок/геометрии. Если None, автоматически берётся из модели. По умолчанию ``None``.

source: Number of training epochs. Default ``500``.
ru: Количество эпох обучения. По умолчанию ``500``.

source: Batch size per GPU. Default ``3``.
ru: Размер батча на GPU. По умолчанию ``3``.

source: Number of gradient accumulation steps. Effective batch size will be ``batch_size * accumulation_steps``. Use this to train with larger effective batch sizes when GPU memory is limited. For example: - ``batch_size=2, accumulation_steps=4`` → effective batch size = 8 - ``batch_size=1, accumulation_steps=8`` → effective batch size = 8 Default is ``1`` (no accumulation).
ru: Количество шагов накопления градиента. Эффективный размер батча будет ``batch_size * accumulation_steps``. Используйте это для обучения с большими эффективными батчами при ограниченной памяти GPU. Например: - ``batch_size=2, accumulation_steps=4`` → эффективный размер батча = 8 - ``batch_size=1, accumulation_steps=8`` → эффективный размер батча = 8 По умолчанию ``1`` (без накопления).

source: Number of gradient accumulation steps. Effective batch size will be ``batch_size * accumulation_steps``. Use this to train with larger effective batch sizes when GPU memory is limited. For example:
ru: Количество шагов накопления градиента. Эффективный размер батча будет ``batch_size * accumulation_steps``. Используется для обучения с большими эффективными батчами при ограниченной памяти GPU. Например:

source: ``batch_size=2, accumulation_steps=4`` → effective batch size = 8
ru: ``batch_size=2, accumulation_steps=4`` → эффективный размер батча = 8

source: ``batch_size=1, accumulation_steps=8`` → effective batch size = 8
ru: ``batch_size=1, accumulation_steps=8`` → эффективный размер батча = 8

source: Default is ``1`` (no accumulation).
ru: По умолчанию ``1`` (без накопления).

source: Learning rate. Default ``1e-3``.
ru: Скорость обучения. По умолчанию ``1e-3``.

source: Gradient clipping value (L2 norm). Default ``5.0``.
ru: Значение отсечения градиента (L2-норма). По умолчанию ``5.0``.

source: Patience (epochs without improvement) for early stopping. Default ``100``.
ru: Терпение (число эпох без улучшений) для ранней остановки. По умолчанию ``100``.

source: Enable SAM optimizer. Default ``True``.
ru: Включить оптимизатор SAM. По умолчанию ``True``.

source: Variant of SAM to use. Default ``"asam"``.
ru: Используемый вариант SAM. По умолчанию ``"asam"``.

source: Wrap optimizer with Lookahead. Default ``True``.
ru: Обернуть оптимизатор в Lookahead. По умолчанию ``True``.

source: Maintain EMA version of model weights. Default ``False``.
ru: Поддерживать EMA-версию весов модели. По умолчанию ``False``.

source: Random multi-scale training. Default ``True``.
ru: Случайное мульти-масштабное обучение. По умолчанию ``True``.

source: Online Hard Example Mining. Default ``True``.
ru: Онлайн-отбор сложных примеров (OHEM). По умолчанию ``True``.

source: Ratio of hard negatives for OHEM. Default ``0.5``.
ru: Доля сложных негативных примеров для OHEM. По умолчанию ``0.5``.

source: Apply focal loss to geometry channels. Default ``True``.
ru: Применять focal loss к геометрическим каналам. По умолчанию ``True``.

source: Gamma for focal geometry loss. Default ``2.0``.
ru: Параметр gamma для focal loss геометрии. По умолчанию ``2.0``.

source: Resume training from a previous experiment: a) experiment directory, b) `.../checkpoints/`, c) direct path to `last_state.pt`. Default ``None``.
ru: Возобновить обучение из предыдущего эксперимента: a) каталог эксперимента, b) `.../checkpoints/`, c) прямой путь к `last_state.pt`. По умолчанию ``None``.

source: Run validation every N epochs. Default ``1``.
ru: Запускать валидацию каждые N эпох. По умолчанию ``1``.

source: Number of worker processes for data loading. Set to 0 for single-process loading (safer on Windows). Default ``0``.
ru: Количество рабочих процессов для загрузки данных. Установите 0 для однопроцессной загрузки (безопаснее на Windows). По умолчанию ``0``.

source: CUDA or CPU device. Auto-selects if None.
ru: Устройство CUDA или CPU. Автоматически выбирается, если None.

source: Best model weights (EMA if enabled, otherwise base model).
ru: Лучшие веса модели (EMA, если включено, иначе базовая модель).

source: Train on two datasets with validation:
ru: Обучение на двух датасетах с валидацией:

source: This method converts a trained EAST model from PyTorch to ONNX format, which can be used for faster inference with ONNX Runtime. The exported model can be loaded using ``EAST(weights_path="model.onnx", use_onnx=True)``.
ru: Этот метод конвертирует обученную модель EAST из PyTorch в формат ONNX, который может использоваться для более быстрого инференса с ONNX Runtime. Экспортированную модель можно загрузить с помощью ``EAST(weights_path="model.onnx", use_onnx=True)``.

source: Path to the PyTorch model weights file (.pth).
ru: Путь к файлу весов модели PyTorch (.pth).

source: Path where the ONNX model will be saved (.onnx).
ru: Путь, по которому будет сохранена модель ONNX (.onnx).

source: Backbone architecture of the model. If None, will be automatically detected from the checkpoint. Must match the architecture used during training. Default is None (auto-detect).
ru: Архитектура backbone модели. Если None, будет автоматически определена из чекпоинта. Должна совпадать с архитектурой, использованной при обучении. По умолчанию None (автоопределение).

source: Input image size (height and width). The model will accept images of shape ``(batch, 3, input_size, input_size)``. Default is 1280.
ru: Размер входного изображения (высота и ширина). Модель принимает изображения формы ``(batch, 3, input_size, input_size)``. По умолчанию 1280.

source: ONNX opset version to use for export. Default is 14.
ru: Версия opset ONNX для экспорта. По умолчанию 14.

source: If True, applies ONNX graph simplification using onnx-simplifier to optimize the model. Requires ``onnx-simplifier`` package. Default is True.
ru: Если True, применяется упрощение графа ONNX с помощью onnx-simplifier для оптимизации модели. Требуется пакет ``onnx-simplifier``. По умолчанию True.

source: The ONNX model is saved to ``output_path``.
ru: Модель ONNX сохраняется в ``output_path``.

source: Raises
ru: Исключения

source: If required packages (torch, onnx) are not installed.
ru: Если необходимые пакеты (torch, onnx) не установлены.

source: If ``weights_path`` does not exist.
ru: Если ``weights_path`` не существует.

source: If backbone_name doesn't match the checkpoint architecture.
ru: Если backbone_name не соответствует архитектуре чекпоинта.

source: The exported ONNX model has two outputs:
ru: Экспортированная модель ONNX имеет два выхода:

source: ``score_map``: Text confidence map with shape ``(batch, 1, H, W)``
ru: ``score_map``: карта уверенности текста формы ``(batch, 1, H, W)``

source: ``geo_map``: Geometry map with shape ``(batch, 8, H, W)``
ru: ``geo_map``: карта геометрии формы ``(batch, 8, H, W)``

source: The model supports dynamic batch size and image dimensions through dynamic axes configuration.
ru: Модель поддерживает динамический размер батча и размеры изображения через настройку динамических осей.

source: **Automatic Backbone Detection:**
ru: **Автоматическое определение backbone:**

source: The method automatically detects the backbone architecture from the checkpoint by analyzing the number of parameters in layer4. This prevents mismatches between checkpoint and architecture that could lead to incorrect exports.
ru: Метод автоматически определяет архитектуру backbone из чекпоинта, анализируя количество параметров в layer4. Это предотвращает несоответствия между чекпоинтом и архитектурой, которые могли бы привести к некорректному экспорту.

source: Export with automatic backbone detection:
ru: Экспорт с автоматическим определением backbone:

source: Export with explicit backbone:
ru: Экспорт с явным указанием backbone:

source: Use the exported model for inference:
ru: Использование экспортированной модели для инференса:

source: Initialize EAST detector with ONNX support using ``use_onnx=True``.
ru: Инициализация детектора EAST с поддержкой ONNX с использованием ``use_onnx=True``.
