Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/api/pipeline.po
Languages: ru

source: Pipeline
ru: Конвейер

source: The main high-level interface for OCR processing.
ru: Основной высокоуровневый интерфейс для OCR-обработки.

source: High-level OCR pipeline combining text detection and recognition.
ru: Высокоуровневый OCR-конвейер, объединяющий детекцию и распознавание текста.

source: The Pipeline class orchestrates EAST detector and TRBA recognizer to perform complete OCR workflow: detection → crop extraction → recognition → result merging.
ru: Класс Pipeline координирует детектор EAST и распознаватель TRBA для выполнения полного OCR-процесса: детекция → извлечение кропов → распознавание → объединение результатов.

source: Parameters
ru: Параметры

source: Text detector instance
ru: Экземпляр детектора текста

source: type
ru: тип

source: Text recognizer instance
ru: Экземпляр распознавателя текста

source: Minimum text box size in pixels (width and height)
ru: Минимальный размер текстового бокса в пикселях (ширина и высота)

source: Examples
ru: Примеры

source: Create pipeline with default models:
ru: Создание конвейера с моделями по умолчанию:

source: Create pipeline with custom models:
ru: Создание конвейера с пользовательскими моделями:

source: Methods
ru: Методы

source: Extract plain text from Page object.
ru: Извлечение обычного текста из объекта Page.

source: Run OCR pipeline on a single image.
ru: Запуск OCR-конвейера на одном изображении.

source: Initialize OCR pipeline.
ru: Инициализация OCR-конвейера.

source: Text detector instance. If None, creates default EAST detector.
ru: Экземпляр детектора текста. Если None, создаётся детектор EAST по умолчанию.

source: Text recognizer instance. If None, creates default TRBA recognizer.
ru: Экземпляр распознавателя текста. Если None, создаётся распознаватель TRBA по умолчанию.

source: Minimum text size in pixels. Boxes smaller than this will be filtered out before recognition. Default is 5.
ru: Минимальный размер текста в пикселях. Боксы меньшего размера будут отфильтрованы перед распознаванием. По умолчанию 5.

source: Input image. Can be: - Path to image file (str or Path) - RGB numpy array with shape (H, W, 3) in uint8 - PIL Image object
ru: Входное изображение. Может быть: - путь к файлу изображения (str или Path) - RGB-массив NumPy формы (H, W, 3) в формате uint8 - объект PIL Image

source: If True, performs both detection and recognition. If False, performs only detection. Default is True.
ru: Если True, выполняет детекцию и распознавание. Если False, выполняет только детекцию. По умолчанию True.

source: If True, returns visualization image along with results. Default is False.
ru: Если True, возвращает изображение визуализации вместе с результатами. По умолчанию False.

source: If True, prints timing information for each pipeline stage. Default is False.
ru: Если True, выводит информацию о времени выполнения каждого этапа конвейера. По умолчанию False.

source: Returns
ru: Возвращает

source: If vis=False: dict with keys: - "page" : Page object with detection/recognition results If vis=True: tuple of (result_dict, vis_image)
ru: Если vis=False: словарь с ключами: - "page" : объект Page с результатами детекции/распознавания Если vis=True: кортеж (result_dict, vis_image)

source: If vis=False:
ru: Если vis=False:

source: dict with keys: - "page" : Page object with detection/recognition results
ru: словарь с ключами: - "page" : объект Page с результатами детекции/распознавания

source: If vis=True:
ru: Если vis=True:

source: tuple of (result_dict, vis_image)
ru: кортеж (result_dict, vis_image)

source: Return type
ru: Тип возвращаемого значения

source: Basic usage:
ru: Базовое использование:

source: Detection only:
ru: Только детекция:

source: With visualization:
ru: С визуализацией:

source: With profiling:
ru: С профилированием:

source: Page object with recognition results.
ru: Объект Page с результатами распознавания.

source: Extracted text with lines separated by newlines.
ru: Извлечённый текст, в котором строки разделены переводами строки.
