Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/api/recognizers.po
Languages: ru

source: Recognizers
ru: Распознаватели

source: Text recognition models.
ru: Модели распознавания текста.

source: Initialize TRBA text recognition model with ONNX Runtime.
ru: Инициализация модели распознавания текста TRBA с использованием ONNX Runtime.

source: Parameters
ru: Параметры

source: Path or identifier for ONNX model weights. Supports: - Local file path: ``"path/to/model.onnx"`` - HTTP/HTTPS URL: ``"https://example.com/model.onnx"`` - GitHub release: ``"github://owner/repo/tag/file.onnx"`` - Google Drive: ``"gdrive:FILE_ID"`` - Preset name: ``"trba_lite_g1"`` or ``"trba_base_g1"`` (from pretrained_registry) - ``None``: auto-downloads default preset (trba_lite_g1)
ru: Путь или идентификатор весов ONNX-модели. Поддерживаются: - локальный путь к файлу: ``"path/to/model.onnx"`` - HTTP/HTTPS URL: ``"https://example.com/model.onnx"`` - релиз GitHub: ``"github://owner/repo/tag/file.onnx"`` - Google Drive: ``"gdrive:FILE_ID"`` - имя пресета: ``"trba_lite_g1"`` или ``"trba_base_g1"`` (из pretrained_registry) - ``None``: автоматическая загрузка пресета по умолчанию (trba_lite_g1)

source: Path or identifier for ONNX model weights. Supports:
ru: Путь или идентификатор весов ONNX-модели. Поддерживается:

source: Local file path: ``"path/to/model.onnx"``
ru: Локальный путь к файлу: ``"path/to/model.onnx"``

source: GitHub release: ``"github://owner/repo/tag/file.onnx"``
ru: Релиз GitHub: ``"github://owner/repo/tag/file.onnx"``

source: Preset name: ``"trba_lite_g1"`` or ``"trba_base_g1"`` (from pretrained_registry)
ru: Имя пресета: ``"trba_lite_g1"`` или ``"trba_base_g1"`` (из pretrained_registry)

source: ``None``: auto-downloads default preset (trba_lite_g1)
ru: ``None``: автоматически загружает пресет по умолчанию (trba_lite_g1)

source: Path or identifier for model configuration JSON. Same URL schemes as ``weights``. If ``None``, attempts to infer from weights location or uses default config for preset models.
ru: Путь или идентификатор JSON-конфигурации модели. Поддерживает те же схемы, что и ``weights``. Если ``None``, конфигурация определяется по расположению весов или используется конфигурация по умолчанию для пресетов.

source: Path or identifier for character set file. If ``None``, attempts to find charset near weights or falls back to package default.
ru: Путь или идентификатор файла набора символов. Если ``None``, набор символов ищется рядом с весами или используется вариант по умолчанию из пакета.

source: Compute device. If ``None``, automatically selects CPU. For GPU/CoreML acceleration: - CUDA (NVIDIA): ``pip install onnxruntime-gpu`` - CoreML (Apple Silicon M1/M2/M3): ``pip install onnxruntime-silicon`` Default is ``None`` (CPU).
ru: Устройство вычислений. Если ``None``, автоматически выбирается CPU. Для ускорения GPU/CoreML: - CUDA (NVIDIA): ``pip install onnxruntime-gpu`` - CoreML (Apple Silicon M1/M2/M3): ``pip install onnxruntime-silicon`` По умолчанию ``None`` (CPU).

source: Default is ``None`` (CPU).
ru: По умолчанию ``None`` (CPU).

source: Additional configuration options (reserved for future use).
ru: Дополнительные параметры конфигурации (зарезервированы для будущего использования).

source: Raises
ru: Исключения

source: If specified files do not exist.
ru: Если указанные файлы не существуют.

source: If weights format is invalid.
ru: Если формат весов некорректен.

source: The class provides three main public methods:
ru: Класс предоставляет три основных публичных метода:

source: ``predict`` — run text recognition inference on cropped word images.
ru: ``predict`` — запуск распознавания текста на обрезанных изображениях слов.

source: ``train`` — high-level training entrypoint to train a TRBA model on custom datasets.
ru: ``train`` — высокоуровневая точка входа для обучения модели TRBA на пользовательских датасетах.

source: ``export`` — static method to export PyTorch model to ONNX format.
ru: ``export`` — статический метод экспорта модели PyTorch в формат ONNX.

source: Model uses ONNX Runtime for fast inference on CPU and GPU. For GPU acceleration, install: ``pip install onnxruntime-gpu``
ru: Модель использует ONNX Runtime для быстрого инференса на CPU и GPU. Для ускорения на GPU установите: ``pip install onnxruntime-gpu``

source: Examples
ru: Примеры

source: Create recognizer with default preset (auto-downloads):
ru: Создание распознавателя с пресетом по умолчанию (автозагрузка):

source: Load from local ONNX file:
ru: Загрузка из локального ONNX-файла:

source: Load from GitHub release:
ru: Загрузка из релиза GitHub:

source: Force CPU execution:
ru: Принудительное выполнение на CPU:

source: Methods
ru: Методы

source: Run text recognition on one or more word images.
ru: Запуск распознавания текста на одном или нескольких изображениях слов.

source: Number of images to process simultaneously. Larger batches are faster but require more memory. Default is 32.
ru: Количество изображений, обрабатываемых одновременно. Большие батчи работают быстрее, но требуют больше памяти. По умолчанию 32.

source: Recognition results as list of dictionaries, each containing: - ``"text"`` : str — recognized text - ``"confidence"`` : float — recognition confidence in [0, 1] If input is a single image, returns a list with one element.
ru: Результаты распознавания в виде списка словарей, каждый из которых содержит: - ``"text"`` : str — распознанный текст - ``"confidence"`` : float — уверенность распознавания в диапазоне [0, 1]. Если входом является одно изображение, возвращается список из одного элемента.

source: Return type
ru: Тип возвращаемого значения

source: Recognize single image:
ru: Распознавание одного изображения:

source: Process numpy arrays:
ru: Обработка массивов numpy:

source: Path(s) to training CSV files. Each CSV should have columns: ``image_path`` (relative to ``train_roots``) and ``text`` (ground truth transcription).
ru: Путь или пути к CSV-файлам обучения. Каждый CSV должен содержать столбцы: ``image_path`` (относительно ``train_roots``) и ``text`` (эталонная транскрипция).

source: Root directory/directories containing training images. Must have same length as ``train_csvs``.
ru: Корневая директория или директории, содержащие обучающие изображения. Должны иметь ту же длину, что и ``train_csvs``.

source: Path(s) to validation CSV files with same format as ``train_csvs``. If ``None``, no validation is performed. Default is ``None``.
ru: Путь или пути к CSV-файлам валидации с тем же форматом, что и ``train_csvs``. Если ``None``, валидация не выполняется. По умолчанию ``None``.

source: Root directory/directories for validation images. Must match length of ``val_csvs`` if provided. Default is ``None``.
ru: Корневая директория или директории для изображений валидации. Должны соответствовать длине ``val_csvs``, если они указаны. По умолчанию ``None``.

source: Experiment directory where checkpoints and logs will be saved. If ``None``, auto-generated based on timestamp. Default is ``None``.
ru: Директория эксперимента, в которую будут сохраняться чекпойнты и логи. Если ``None``, автоматически создаётся на основе временной метки. По умолчанию ``None``.

source: Path to character set file. If ``None``, uses default charset from package. Default is ``None``.
ru: Путь к файлу набора символов. Если ``None``, используется набор символов по умолчанию из пакета. По умолчанию ``None``.

source: Text encoding for reading CSV files. Default is ``"utf-8"``.
ru: Кодировка текста для чтения CSV-файлов. По умолчанию ``"utf-8"``.

source: Target height for input images (pixels). Default is 64.
ru: Целевая высота входных изображений (в пикселях). По умолчанию 64.

source: Target width for input images (pixels). Default is 256.
ru: Целевая ширина входных изображений (в пикселях). По умолчанию 256.

source: Maximum sequence length for text recognition. Default is 25.
ru: Максимальная длина последовательности для распознавания текста. По умолчанию 25.

source: Hidden dimension size for RNN encoder/decoder. Default is 256.
ru: Размер скрытого слоя RNN-энкодера/декодера. По умолчанию 256.

source: Number of Bidirectional LSTM layers in the encoder. Default is 2.
ru: Количество двунаправленных LSTM-слоёв в энкодере. По умолчанию 2.

source: Number of input channels for CNN backbone (3 for RGB, 1 for grayscale). Default is 3.
ru: Количество входных каналов для CNN-бэкбона (3 для RGB, 1 для оттенков серого). По умолчанию 3.

source: Number of output channels from CNN backbone. Default is 512.
ru: Количество выходных каналов CNN-бэкбона. По умолчанию 512.

source: CNN backbone variant. ``"seresnet31"`` keeps the standard SE-ResNet-31, while ``"seresnet31-lite"`` enables a depthwise-lite version. Default is ``"seresnet31"``.
ru: Вариант CNN-бэкбона. ``"seresnet31"`` использует стандартный SE-ResNet-31, а ``"seresnet31-lite"`` включает облегчённую depthwise-версию. По умолчанию ``"seresnet31"``.

source: Initial weight for CTC loss during training (CTC always used for stability): ``loss = attn_loss * (1 - ctc_weight) + ctc_loss * ctc_weight``. CTC weight decays over epochs. Default is 0.3.
ru: Начальный вес CTC-функции потерь во время обучения (CTC всегда используется для стабильности): ``loss = attn_loss * (1 - ctc_weight) + ctc_loss * ctc_weight``. Вес CTC уменьшается по эпохам. По умолчанию 0.3.

source: Number of epochs for CTC weight to decay to minimum. Default is 50.
ru: Количество эпох, за которые вес CTC уменьшается до минимума. По умолчанию 50.

source: Minimum value for CTC weight after decay. Default is 0.0.
ru: Минимальное значение веса CTC после уменьшения. По умолчанию 0.0.

source: Maximum gradient norm for clipping (prevents gradient explosion/NaN). Default is 5.0.
ru: Максимальная норма градиента для клиппинга (предотвращает взрыв градиентов/NaN). По умолчанию 5.0.

source: Training batch size. Default is 32.
ru: Размер батча обучения. По умолчанию 32.

source: Number of training epochs. Default is 20.
ru: Количество эпох обучения. По умолчанию 20.

source: Learning rate. Default is 1e-3.
ru: Скорость обучения. По умолчанию 1e-3.

source: Optimizer type. Default is ``"AdamW"``.
ru: Тип оптимизатора. По умолчанию ``"AdamW"``.

source: Learning rate scheduler type: - ``"OneCycleLR"`` — one-cycle policy with cosine annealing (default, recommended) - ``"ReduceLROnPlateau"`` — reduce LR on validation loss plateau - ``"CosineAnnealingLR"`` — cosine annealing over epochs - ``"None"`` or ``None`` — constant learning rate Default is ``"OneCycleLR"``.
ru: Тип планировщика скорости обучения: - ``"OneCycleLR"`` — one-cycle политика с косинусным затуханием (по умолчанию, рекомендуется) - ``"ReduceLROnPlateau"`` — уменьшение LR при плато валидационной ошибки - ``"CosineAnnealingLR"`` — косинусное затухание по эпохам - ``"None"`` или ``None`` — постоянная скорость обучения По умолчанию ``"OneCycleLR"``.

source: Learning rate scheduler type:
ru: Тип планировщика скорости обучения:

source: ``"OneCycleLR"`` — one-cycle policy with cosine annealing (default, recommended)
ru: ``"OneCycleLR"`` — one-cycle политика с косинусным затуханием (по умолчанию, рекомендуется)

source: ``"ReduceLROnPlateau"`` — reduce LR on validation loss plateau
ru: ``"ReduceLROnPlateau"`` — уменьшение LR при плато валидационной ошибки

source: ``"CosineAnnealingLR"`` — cosine annealing over epochs
ru: ``"CosineAnnealingLR"`` — косинусное затухание по эпохам

source: ``"None"`` or ``None`` — constant learning rate
ru: ``"None"`` или ``None`` — постоянная скорость обучения

source: Default is ``"OneCycleLR"``.
ru: По умолчанию ``"OneCycleLR"``.

source: L2 weight decay coefficient. Default is 0.0.
ru: Коэффициент L2-регуляризации (weight decay). По умолчанию 0.0.

source: Momentum for SGD optimizer. Default is 0.9.
ru: Параметр momentum для оптимизатора SGD. По умолчанию 0.9.

source: Perform validation every N epochs. Default is 1.
ru: Выполнять валидацию каждые N эпох. По умолчанию 1.

source: Maximum number of validation samples to use. Default is 3000.
ru: Максимальное количество примеров для валидации. По умолчанию 3000.

source: Sampling proportions for multiple training datasets. Must sum to 1.0 and match length of ``train_csvs``. If ``None``, datasets are concatenated equally. Default is ``None``.
ru: Доли выборки для нескольких обучающих датасетов. Должны суммироваться до 1.0 и соответствовать длине ``train_csvs``. Если ``None``, датасеты объединяются с равными весами. По умолчанию ``None``.

source: Number of data loading workers. Default is 0.
ru: Количество рабочих процессов для загрузки данных. По умолчанию 0.

source: Random seed for reproducibility. Default is 42.
ru: Случайное зерно (seed) для воспроизводимости результатов. По умолчанию 42.

source: Path to checkpoint file to resume training from. Default is ``None``.
ru: Путь к файлу чекпойнта для возобновления обучения. По умолчанию ``None``.

source: Save checkpoint every N epochs. If ``None``, only saves best model. Default is ``None``.
ru: Сохранять чекпойнт каждые N эпох. Если ``None``, сохраняется только лучшая модель. По умолчанию ``None``.

source: Training device. Default is ``"cuda"``.
ru: Устройство для обучения. По умолчанию ``"cuda"``.

source: CNN freezing policy. Default is ``"none"``.
ru: Политика заморозки CNN. По умолчанию ``"none"``.

source: Encoder RNN freezing policy. Default is ``"none"``.
ru: Политика заморозки RNN-энкодера. По умолчанию ``"none"``.

source: Attention module freezing policy. Default is ``"none"``.
ru: Политика заморозки модуля внимания (attention). По умолчанию ``"none"``.

source: Pretrained weights to initialize from: - ``"default"`` or ``True`` — use release weights - ``None`` or ``False`` — train from scratch - str/Path — path or URL to custom weights file Default is ``"default"``.
ru: Предобученные веса для инициализации: - ``"default"`` или ``True`` — использовать релизные веса - ``None`` или ``False`` — обучение с нуля - str/Path — путь или URL к пользовательскому файлу весов По умолчанию ``"default"``.

source: Pretrained weights to initialize from:
ru: Предобученные веса для инициализации:

source: ``"default"`` or ``True`` — use release weights
ru: ``"default"`` или ``True`` — использовать релизные веса

source: ``None`` or ``False`` — train from scratch
ru: ``None`` или ``False`` — обучение с нуля

source: str/Path — path or URL to custom weights file
ru: str/Path — путь или URL к пользовательскому файлу весов

source: Default is ``"default"``.
ru: По умолчанию ``"default"``.

source: Additional configuration parameters passed to training config.
ru: Дополнительные параметры конфигурации, передаваемые в настройки обучения.

source: Path to the best model checkpoint saved during training.
ru: Путь к лучшему чекпойнту модели, сохранённому в ходе обучения.

source: Train on single dataset with validation:
ru: Обучение на одном датасете с валидацией:

source: Train on multiple datasets with custom proportions:
ru: Обучение на нескольких датасетах с пользовательскими пропорциями:

source: Resume training from checkpoint:
ru: Возобновление обучения из чекпойнта:

source: Fine-tune from pretrained weights with frozen CNN:
ru: Дообучение с предобученных весов с замороженным CNN:

source: Train with CTC for stability (always enabled):
ru: Обучение с использованием CTC для стабильности (всегда включено):

source: This method converts a trained TRBA model from PyTorch to ONNX format, which can be used for faster inference with ONNX Runtime. The exported model can be loaded using ``TRBA(weights="model.onnx")``.
ru: Этот метод преобразует обученную модель TRBA из PyTorch в формат ONNX, который может использоваться для более быстрого инференса с ONNX Runtime. Экспортированная модель может быть загружена с помощью ``TRBA(weights="model.onnx")``.

source: Path to the PyTorch model weights file (.pth).
ru: Путь к файлу весов модели PyTorch (.pth).

source: Path to the model configuration JSON file. Used to determine model architecture (img_h, img_w, max_len, hidden_size, etc.).
ru: Путь к JSON-файлу конфигурации модели. Используется для определения архитектуры модели (img_h, img_w, max_len, hidden_size и т. д.).

source: Path to the charset file (charset.txt). Used to determine num_classes for the model.
ru: Путь к файлу набора символов (charset.txt). Используется для определения количества классов модели.

source: Path where the ONNX model will be saved (.onnx).
ru: Путь, по которому будет сохранена ONNX-модель (.onnx).

source: ONNX opset version to use for export. Default is 14.
ru: Версия opset ONNX для экспорта. По умолчанию 14.

source: If True, applies ONNX graph simplification using onnx-simplifier to optimize the model. Requires ``onnx-simplifier`` package. Default is True.
ru: Если True, применяется упрощение графа ONNX с помощью onnx-simplifier для оптимизации модели. Требуется пакет ``onnx-simplifier``. По умолчанию True.

source: The ONNX model is saved to ``output_path``.
ru: ONNX-модель сохраняется в ``output_path``.

source: If required packages (torch, onnx) are not installed.
ru: Если необходимые пакеты (torch, onnx) не установлены.

source: If ``weights_path`` or ``config_path`` do not exist.
ru: Если ``weights_path`` или ``config_path`` не существуют.

source: The exported ONNX model has one output:
ru: Экспортированная ONNX-модель имеет один выход:

source: ``logits``: Character predictions with shape ``(batch, max_length+1, num_classes)``
ru: ``logits``: предсказания символов с формой ``(batch, max_length+1, num_classes)``

source: The model uses greedy decoding (argmax) and supports dynamic batch size. The sequence length is fixed to ``max_length + 1`` from the config (same as PyTorch inference mode for compatibility).
ru: Модель использует жадное декодирование (argmax) и поддерживает динамический размер батча. Длина последовательности зафиксирована как ``max_length + 1`` из конфигурации (аналогично режиму инференса PyTorch для совместимости).

source: Architecture exported: - CNN backbone (SE-ResNet-31 or SE-ResNet-31-Lite) - Bidirectional LSTM encoder - Attention decoder (greedy decoding)
ru: Экспортируемая архитектура: - CNN-бэкбон (SE-ResNet-31 или SE-ResNet-31-Lite) - двунаправленный LSTM-энкодер - декодер внимания (жадное декодирование)

source: Note: Only the attention decoder is exported. CTC head is used only during training and is not included in the ONNX model.
ru: Примечание: экспортируется только декодер внимания. CTC-голова используется только во время обучения и не включена в ONNX-модель.

source: Export TRBA model to ONNX:
ru: Экспорт модели TRBA в ONNX:

source: Export with custom opset:
ru: Экспорт с пользовательским opset:

source: Use the exported model for inference:
ru: Использование экспортированной модели для инференса:

source: Initialize TRBA recognizer with ONNX model.
ru: Инициализация распознавателя TRBA с ONNX-моделью.
