Repository: olegiy/manuscript-ocr
Catalog: docs/sphinx/locale/*/LC_MESSAGES/api/utils.po
Languages: ru

source: Utilities
ru: Утилиты

source: Utility functions for image processing, visualization, and more.
ru: Вспомогательные функции для обработки изображений, визуализации и других задач.

source: Common utilities for manuscript-ocr.
ru: Общие утилиты для manuscript-ocr.

source: Universal image reading with support for multiple input types.
ru: Универсальное чтение изображений с поддержкой различных типов входных данных.

source: Parameters
ru: Параметры

source: Image source in one of the following formats: - File path (str or Path) - supports Unicode paths (e.g., Cyrillic) - Bytes buffer (e.g., from HTTP response) - NumPy array (already loaded image) - PIL Image object
ru: Источник изображения в одном из следующих форматов: - путь к файлу (str или Path) — поддерживаются Unicode-пути (например, кириллица) - буфер байтов (например, из HTTP-ответа) - массив NumPy (уже загруженное изображение) - объект PIL Image

source: Returns
ru: Возвращает

source: RGB image as numpy array with shape (H, W, 3) and dtype uint8.
ru: RGB-изображение в виде массива NumPy с формой (H, W, 3) и типом uint8.

source: Return type
ru: Тип возвращаемого значения

source: Raises
ru: Вызывает исключения

source: If the image file cannot be read with either OpenCV or PIL.
ru: Если файл изображения не удаётся прочитать ни с помощью OpenCV, ни с помощью PIL.

source: If the input type is not supported.
ru: Если тип входных данных не поддерживается.

source: If bytes cannot be decoded into an image.
ru: Если байты не могут быть декодированы в изображение.

source: Examples
ru: Примеры

source: Visualize a Page object with detected words/blocks.
ru: Визуализация объекта Page с обнаруженными словами и блоками.

source: This function draws all words from the Page structure on the image, optionally showing reading order with numbered markers and connecting lines. When show_order=True, it also visualizes blocks with semi-transparent bounding boxes, each block having a distinct color.
ru: Эта функция рисует все слова из структуры Page на изображении, при необходимости отображая порядок чтения с помощью нумерованных маркеров и соединяющих линий. При show_order=True также визуализируются блоки с полупрозрачными ограничивающими рамками, при этом каждый блок имеет свой цвет.

source: Input image. Can be: - Path to image file (str or Path) - supports Unicode paths - RGB numpy array with shape (H, W, 3) - PIL Image object
ru: Входное изображение. Может быть: - путь к файлу изображения (str или Path) — поддерживаются Unicode-пути - RGB-массив NumPy с формой (H, W, 3) - объект PIL Image

source: Page object from manuscript.data containing detected blocks/words.
ru: Объект Page из manuscript.data, содержащий обнаруженные блоки и слова.

source: RGB color for word boundaries.
ru: RGB-цвет для границ слов.

source: Line thickness for word boundaries.
ru: Толщина линий для границ слов.

source: Alpha for darkening background (0=no darkening, 1=fully dark).
ru: Альфа-коэффициент затемнения фона (0 — без затемнения, 1 — полностью тёмный).

source: Gaussian blur kernel size (0=no blur, must be odd).
ru: Размер ядра гауссова размытия (0 — без размытия, должен быть нечётным).

source: If True, display reading order with numbers and connecting lines. Also colors different text lines with different colors and shows semi-transparent block boundaries with different colors per block.
ru: Если True, отображает порядок чтения с номерами и соединяющими линиями. Также раскрашивает разные текстовые строки в разные цвета и показывает полупрозрачные границы блоков с разными цветами для каждого блока.

source: RGB color for connecting lines between words.
ru: RGB-цвет для соединяющих линий между словами.

source: Background color for order number boxes.
ru: Цвет фона для блоков с номерами порядка.

source: Text color for order numbers.
ru: Цвет текста для номеров порядка.

source: Maximum size for the longer dimension of the output image. Image will be resized proportionally if larger. Set to None to keep original size.
ru: Максимальный размер большей стороны выходного изображения. Если изображение больше, оно будет пропорционально уменьшено. Установите None, чтобы сохранить исходный размер.

source: Visualized image with detection boxes and optional reading order annotations. When show_order=True, also includes semi-transparent block boundaries.
ru: Визуализированное изображение с рамками детекции и, при необходимости, аннотациями порядка чтения. При show_order=True также включает полупрозрачные границы блоков.

source: Basic visualization without reading order:
ru: Базовая визуализация без порядка чтения:

source: Visualization with reading order and block boundaries:
ru: Визуализация с порядком чтения и границами блоков:

source: Organize words in a Page into structured Blocks, Lines, and reading order.
ru: Организация слов на странице Page в структурированные блоки, строки и порядок чтения.

source: Takes a Page with unorganized words and returns a new Page where: - Words are grouped into columns (Blocks) - Each Block contains Lines of Words - Words within Lines are ordered left-to-right - Lines within Blocks are ordered top-to-bottom - Blocks are ordered left-to-right (for columns)
ru: Принимает Page с неорганизованными словами и возвращает новый Page, где: - слова сгруппированы в колонки (Blocks) - каждый блок содержит строки слов - слова внутри строк упорядочены слева направо - строки внутри блоков упорядочены сверху вниз - блоки упорядочены слева направо (для колонок)

source: Input Page object. Can contain either: - Words in unstructured blocks/lines - Direct list of words without proper organization
ru: Входной объект Page. Может содержать: - слова в неструктурированных блоках/строках - прямой список слов без корректной организации

source: Maximum number of column splits to attempt when segmenting. Higher values allow more columns to be detected. Default is 10.
ru: Максимальное количество попыток разбиения на колонки при сегментации. Большие значения позволяют обнаруживать больше колонок. По умолчанию 10.

source: If True, segments the page into columns (separate Blocks). If False, treats entire page as single column. Default is True.
ru: Если True, сегментирует страницу на колонки (отдельные блоки). Если False, рассматривает всю страницу как одну колонку. По умолчанию True.

source: New Page object with organized Blocks, Lines, and reading order set.
ru: Новый объект Page с организованными блоками, строками и установленным порядком чтения.

source: Notes
ru: Примечания

source: This function extracts all words from the input Page (regardless of their current organization), converts them to bounding boxes, performs column segmentation and line sorting, then rebuilds a clean Page structure.
ru: Эта функция извлекает все слова из входного Page (независимо от их текущей организации), преобразует их в ограничивающие прямоугольники, выполняет сегментацию на колонки и сортировку строк, а затем заново строит чистую структуру Page.

source: The function preserves all Word attributes (polygon, confidence, text, etc.) while updating the `order` field for reading sequence.
ru: Функция сохраняет все атрибуты Word (полигон, уверенность, текст и т. д.), обновляя при этом поле `order`, отвечающее за последовательность чтения.

source: Set random seed for reproducibility across random, numpy, and PyTorch.
ru: Установка случайного зерна для воспроизводимости в random, NumPy и PyTorch.
